Напиши функцию delay(ms), которая возвращает промис, переходящий в состояние "resolved" через ms миллисекунд. 
Значением исполнившегося промиса должно быть то кол-во миллисекунд которое передали во время вызова функции delay.


const  delay  =  ms  =>  { 
    // Твой код 
  } ;
  
  const  logger  =  час  =>  консоль . log ( `Вирішено після $ { time } мс` ) ;
  
  // Визови функції для перевірки 
  delay ( 2000 ) . then ( реєстратор ) ;  // Вирішено після 
  затримки 2000 мс ( 1000 ) . then ( реєстратор ) ;  // Вирішено після 
  затримки 1000 мс ( 1500 ) . then ( реєстратор ) ;  // Вирішено через 1500 мс